#+TITLE: Error handling and logging

#+PROPERTY: header-args:haskell :results replace output
#+PROPERTY: header-args:haskell+ :noweb yes
#+PROPERTY: header-args:haskell+ :wrap EXAMPLE

- Exceptions and when to use them.
- Several exception handling mechanisms.
- Design exception handling in pure/impure code.

Real world is unforgiving: a file could not exists, a network connection may
break, a memory allocation can fail... You cannot check everything in advance,
shit happens, how should we react?

** Evaluating RPN expressions
- We want to evaluate a list of expressions all at once.
- We want to have variables in our expressions (given by a ~Reader~ accessible
  environment).
- We want to get a clear indication of what's wrong with an expression.

#+NAME: rpn-01
#+BEGIN_SRC haskell :results none
import qualified Data.Text as T

-- To hold values while evaluating an expression
type Stack = [Integer]
-- To hold variables and their value
type Variables = [(T.Text, Integer)]
#+END_SRC

What could go wrong while evaluating an expression?
- Not enough values on the stack
- More than one value at the end on the stack
- Use of unknown variable
- When something should be a number but it's not

Then we define all those cases

#+NAME: rpn-02
#+BEGIN_SRC haskell :results none
<<rpn-01>>

:set -XOverloadedStrings

import TextShow

:{
data EvalError = NotEnoughElements
               | ExtraElements
               | NotANumber T.Text
               | UnknownVar T.Text
:}

:{
instance TextShow EvalError where
  showb NotEnoughElements = "Not enough elements in the expression"
  showb ExtraElements = "There are extra elements in the expression"
  showb (NotANumber n) = "In expression '" <> (fromText n) <> "' is not a number"
  showb (UnknownVar v) = "Variable '" <> (fromText v) <> "' is not defined"
:}
#+END_SRC

Now we can define our monad stack

#+NAME: rpn-03
#+BEGIN_SRC haskell :results none
<<rpn-02>>

import Control.Monad.Reader
import Control.Monad.State
import Control.Monad.Except

type EvalM = ReaderT Variables (ExceptT EvalError (State Stack))
#+END_SRC

Evaluate one expression

#+NAME: rpn-04
#+BEGIN_SRC haskell :results none
<<rpn-03>>

:{
push :: Integer -> EvalM ()
push x = modify (x:)
:}

:{
pop :: EvalM Integer
pop = get >>= pop'
  where
    pop' :: Stack -> EvalM Integer
    pop' [] = throwError NotEnoughElements
    pop' (x:xs) = put xs >> pure x
:}

:{
popOnly :: EvalM Integer
popOnly = check >> pop
  where
    check :: EvalM ()
    check = do
      len <- gets length
      when (len /= 1) $ throwError ExtraElements
:}

:{
readVar :: T.Text -> EvalM Integer
readVar name = do
  var <- asks (lookup name)
  case var of
    Just n -> return n
    Nothing -> throwError $ UnknownVar name
:}

import Text.Read (readMaybe)

:{
readNumber :: T.Text -> EvalM Integer
readNumber t = case readMaybe $ T.unpack t of
                 Just n -> return n
                 Nothing -> throwError $ NotANumber t
:}

:{
readSafe :: T.Text -> EvalM Integer
readSafe t
  | isVar t = readVar t
  | otherwise = readNumber t
  where isVar t = case T.unpack t of
                    (c:_) -> Data.Char.isAlpha c
                    _ -> False
:}

import Data.Foldable (traverse_)

:{
evalOne :: T.Text -> EvalM Integer
evalOne t = clearStack >> traverse_ step (T.words t) >> popOnly
  where
    clearStack :: EvalM ()
    clearStack = put []
    step "+" = stepOp (+)
    step "*" = stepOp (*)
    step "-" = stepOp (-)
    step t = readSafe t >>= push
    stepOp op = flip op <$> pop <*> pop >>= push
:}
#+END_SRC

Eval many

#+NAME: rpn-05
#+BEGIN_SRC haskell
<<rpn-04>>

:{
reportEval :: Either EvalError [Builder] -> T.Text
reportEval (Left e) = "Error: " <> showt e
reportEval (Right b) = toText $ unlinesB b
:}

:{
evalMany :: [T.Text] -> Variables -> T.Text
evalMany t var = reportEval $ evalState (runExceptT (runReaderT (mapM eval t) var)) []
  where
    eval t = (fromText t <> ) <$> (buildOk <$> evalOne t) `catchError` (pure . buildErr)
    buildOk res = " = " <> showb res
    buildErr err = " Error: " <> showb err
:}

T.lines $ evalMany ["x", "40 2 +", "1", "+", "x 12 *"] [("x", 3)]
#+END_SRC

#+RESULTS: rpn-05
#+BEGIN_EXAMPLE
["x = 3","40 2 + = 42","1 = 1","+ Error: Not enough elements in the expression","x 12 * = 36"]
#+END_EXAMPLE

* 7.3 GHC runtime exceptions
The GHC runtime systems implements an exception throwing/handling mechanism.

RULE: exception can be thrown anywhere but can be caught only in ~IO~
computations.

The ~Control.Exception~ module defines:
- A type that encapsulate any exception (~SomeException~)
- A type class that defines methods for wrapping/unwrapping exceptions
  (~Exception~)
- Types for particular exceptions thrown by the runtime (ex. ~ArithException~)
- Utilities to throw/catch exceptions

We will use ~Control.Monad.Catch~ from ~exceptions~ package to handle runtime
exceptions easier in a monad stack.

#+BEGIN_SRC haskell
import Control.Exception

:i SomeException
:i Exception
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
type SomeException :: *
data SomeException = forall e. Exception e => SomeException e
        -- Defined in ‘GHC.Exception.Type’
instance Show SomeException -- Defined in ‘GHC.Exception.Type’
instance TextShow SomeException
  -- Defined in ‘TextShow.Control.Exception’
instance Exception SomeException -- Defined in ‘GHC.Exception.Type’
type Exception :: * -> Constraint
class (base-4.14.3.0:Data.Typeable.Internal.Typeable e, Show e) =>
      Exception e where
  toException :: e -> SomeException
  fromException :: SomeException -> Maybe e
  displayException :: e -> String
        -- Defined in ‘GHC.Exception.Type’
instance Exception ErrorCall -- Defined in ‘GHC.Exception’
instance Exception SomeException -- Defined in ‘GHC.Exception.Type’
instance Exception ArithException
  -- Defined in ‘GHC.Exception.Type’
instance Exception TypeError -- Defined in ‘Control.Exception.Base’
instance Exception RecUpdError
  -- Defined in ‘Control.Exception.Base’
instance Exception RecSelError
  -- Defined in ‘Control.Exception.Base’
instance Exception RecConError
  -- Defined in ‘Control.Exception.Base’
instance Exception PatternMatchFail
  -- Defined in ‘Control.Exception.Base’
instance Exception NonTermination
  -- Defined in ‘Control.Exception.Base’
instance Exception NoMethodError
  -- Defined in ‘Control.Exception.Base’
instance Exception NestedAtomically
  -- Defined in ‘Control.Exception.Base’
instance Exception SomeAsyncException
  -- Defined in ‘GHC.IO.Exception’
instance Exception IOException -- Defined in ‘GHC.IO.Exception’
instance Exception Deadlock -- Defined in ‘GHC.IO.Exception’
instance Exception CompactionFailed
  -- Defined in ‘GHC.IO.Exception’
instance Exception BlockedIndefinitelyOnSTM
  -- Defined in ‘GHC.IO.Exception’
instance Exception BlockedIndefinitelyOnMVar
  -- Defined in ‘GHC.IO.Exception’
instance Exception AsyncException -- Defined in ‘GHC.IO.Exception’
instance Exception AssertionFailed -- Defined in ‘GHC.IO.Exception’
instance Exception ArrayException -- Defined in ‘GHC.IO.Exception’
instance Exception AllocationLimitExceeded
  -- Defined in ‘GHC.IO.Exception’
#+END_EXAMPLE

Define and use a simple arithmetic exception

#+NAME: math-exception
#+BEGIN_SRC haskell :results none
:set -XDeriveAnyClass

import Control.Exception

data MathException = DivByZero deriving (Show, Exception)

-- throw an exception

-- `throw` will throw an exception in pure code
-- `throwIO` will throw an exception in IO computation
-- `ioThrow` will throw a specific `IOException`
-- `throwTo` will throw an exception in a target thread

:{
divPure :: Int -> Int -> Int
divPure _ 0 = throw DivByZero
divPure n m = n `div` n
:}
#+END_SRC

#+BEGIN_SRC haskell
<<math-exception>>

fst (divPure 5 5, divPure 5 0)
divPure 5 0
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
1
,*** Exception: DivByZero
#+END_EXAMPLE

~MonadThrow~ type class from the ~exception~ package defines a class of monads
able to throw exceptions

#+NAME: div-m
#+BEGIN_SRC haskell :results none
<<math-exception>>

import Control.Monad.Catch

:{
divM :: MonadThrow m => Int -> Int -> m Int
divM _ 0 = throwM DivByZero
divM n m = pure $ n `div` m
:}

checkComputation a b c = divM a b >>= divM c
#+END_SRC

#+BEGIN_SRC haskell
<<div-m>>

checkComputation 6 3 10 :: Maybe Int
checkComputation 6 0 10 :: Maybe Int
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
Just 5
Nothing
#+END_EXAMPLE

** Recover after exception
Suppose we want to run ~divM~ and return ~0~ in case of ~DivByZero~, we use
~try :: Exception e => IO a -> IO (Either e a)~

#+BEGIN_SRC haskell
<<div-m>>

import Data.Functor ((<&>))

-- NOTE: it works because ~IO~ implements ~MonadThrow~ for ~divM~

:{
divWithRecovery :: Int -> Int -> IO Int
divWithRecovery x y = Control.Exception.try (divM x y) <&> dealWith
  where
    dealWith :: Either MathException Int -> Int
    dealWith (Left e) = 0
    dealWith (Right n) = n
:}

divWithRecovery 9 0
divWithRecovery 9 9
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
0
1
#+END_EXAMPLE

** Exception handling with ~catch~ and ~handle~

~Control.Exception.catch :: Exception e => IO a -> (e -> IO b) -> IO a~
~Control.Monad.Catch.catch :: (MonadCatch m, Exception e) => m a -> (e -> m b) -> m a~

#+BEGIN_SRC haskell
<<div-m>>

:{
divTest :: Int -> Int -> IO Int
divTest x y = divM x y `Control.Exception.catch` handler
  where
    handler :: MathException -> IO Int
    handler e = do
      putStrLn $ "Caught an exception: " ++ show e
      pure 0
:}

divTest 9 0
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
Caught an exception: DivByZero
0
#+END_EXAMPLE

